Revit 2027 API
BuiltInFailures.DuctFailures.FlexDuctLengthOutOfLimits Property
 The flex duct length of [Length Value] exceeds the maximum specified length of [Maximum Flex Duct Length Value]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FlexDuctLengthOutOfLimits { get; }
Public Shared ReadOnly Property FlexDuctLengthOutOfLimits As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FlexDuctLengthOutOfLimits {
	FailureDefinitionId^ get ();
}
static member FlexDuctLengthOutOfLimits : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DuctFailures Class
Autodesk.Revit.DB Namespace